#2) შექმენით პროგრამა while ციკლის საშვალებით რომელიც გამოთვლის ყველა ნატურალური რიცხვის ჯამს 1-იდან 50-მდე

num = 0
sum = 0
while num < 50:
   sum=sum+num
   num=num+1
print(sum)



#3) შექმენით პროგრამა რომელიც მომხმარებელს შეეკითხება pin კოდს (4 ციფრიანი კოდი) მანამდე სანამ არ შეიყვანს 1234-ს

pin=""
while pin != "1234":
    pin=input("enter pin four number: ")
    if pin == "1234":
     print("pin correct")
    else :
     print("pin incorrect")

#4)შექმნით რიცხვის გამოცნობის თამაში while ციკლით, რომელიც მომხმარებელს შეეკითხება რიცხვს 1-დან 10-მდე, სანამ მომხმარებელი არ შეიყვანს თქვენთვის სასურველ რიცხვს

win_num=""
while win_num != "5":
    win_num=input("Enter a number from 1 to 10: ")
    if win_num == "5":
        print("you win ")
    else:
     print("you loss ")


#5) ტექსტურ ფაილში ახსენით როდის ვიყენებთ while ციკლს და როდის for ციკლს

#პასუხი:for ციკლს ვიყენებთ მაშინ როდესაც ვიცი რამდენჯერაა საჭირო გამეორება, ხოლო while ცილკს ვიყენებთ მაშინ როცა არ ვიცით რამდენჯერაა გამეორება საჭირო.

     
