#2)კომენტარის მეშვეობით ახსენით რა არის bug და debugging.
#ბაგი არის ჩვენს დაწერილ პროგრამაში აღმოჩენილი შეცდომა, ხოლო დებაგინგი გვეხმარება ამ შეცდომის აღმოჩენაში და გამოსწორებაში

#3)დაწერეთ კოდი შეცდომებით და ქვემოთ მიუწერეთ მისი სწორი ვერსია.
#კოდი შეცდომებით
first name="giorgi"
last_name="iadze
full_name=(first_name+last_name)
print=(full_name)
#კოდი შეცდომების გარეშე
first_name="giorgi"
last_name="iadze"
full_name=(first_name+" "+last_name)
print(full_name)

#4)გააკეთეთ ხუთ ხუთი მაგალითი ყველა განვლილ მათემატიკურ ოპერატორზე
num1=5
num2=10
print(num1+num2)
num1=5
num2=10
print(num1*num2)
num1=10
num2=5
print(num1/num2)
num1=10
num2=5
print(num1-num2)
num1=900
num2=350
print(num1+num2)

#5)შექმენით ცვლადები და შიგნით შეინახეთ თქვენი ოჯახის წევრების ასაკები, საბოლოოდ დაბეჭდეთ ყველა ასაკის ჯამი.
mother_age=51
father_age=52
sister_age1=27
sister_age2=9
print(mother_age+father_age+sister_age1+sister_age2)

#6) კომენტარებით აღწერეთ, რა არის დროებითი მეხსიერება და რისთვის გვჭირდება ის.
#დროებითი მეხსიერება არის საცავი სადაც ჩვენი პროგრამული მოქმედებები ინახება დროებით სანამ ჩვენ პროცესს დავასრულებთ,მხოლოდ როდესაც ჩვენ პროცესს დავასრლებთ შემდეგ ის იშლება
#ესიგივეა რაც კონცერტის ბილეთი შევიძინო დავესწროო კონცერტს და შემდეგ ბილეთი გადავაგდო 

#7) აიღეთ ნებისმიერი რიცხვი, მაგალითად 50. გადაიყვანეთ იგი ორობით სისტემაში, მიღებული შედეგი კი დააბრუნეთ ათობითში. დახატეთ და ახსენით ეს დავალება paint-ის გამოყენებით(დასქრინეთ თქვენი ნამუშევარი)
