# 3) კომენტარებით აღზერე ცვლადის შექმნის თითოეული ნაბიჯი(სულ 3)
#jer unda shevqmnat cvladis saxeli
#shemdeg vuwert "=" nishans
#shemdeg vanichebt mnishvnelobas (int,str,float)

#4) შექმენით სამი ცვლადი num1, num2 და num3, შემდეგ კი დაპრინტეთ მათი ჯამი
num1=(10)
num2=(5)
num3=(8.5)
print(num1+num2+num3)

#5) შექმენით ორი ცვლადი x, y და დაპრინტეთ მათი ნამრავლი.
x=(10)
y=(5)
print(x*y)

#6) მართკუთხედის პერიმეტრი:
#შექმენით ორი ცვლადი length და width(მართკუთხედის გვერდები), მიანიჭეთ მნიშვნელობებად 20 და 10. გამოითვალეთ მართკუთხედის პერიმეტრი და დაპრინტეთ
length=(10)
width=(20)
print((length*2)+(width*2))

#7) შექმენით სამი ცვლადი age1, age2, age3, სადაც შეინახავთ თქვენი და ოჯახის წევრების ასაკს. გაიგეთ ცვლადებში შენახული მნიშვნელობების საშუალო არითმეტიკული და დაპრინტეთ.
age1=(26)
age2=(27)
age3=(9)
print((age1+age2+age3)/3)

#8) შექმენით ორი ცვლადი, პირველში შეინახეთ თქვენი სახელი, მეორეში გვარი. მოახდინეთ კონკადინაცია(რესურსებში არის ჩაგდებული და გადახედეთ) ამ ორ ცვლადს შორის და პასუხი შეინახეთ ახალ ცვლადში სახელად result. დაბეჭდეთ result ცვლადი.
name=("giorgi")
surname=("iadze")
fullname=(name+" "+surname)
print(fullname)

#9) შექმენით ორი ცვლადი age და fullname, პირველში შეინახეთ თქვენი ასაკი, ხოლო მეორეში სრული სახელი(სახელი და გვარი). დაბეჭდეთ fullname ცვლადში შენახული მნიშვნელობა იმდენჯერ, რამდენი წლისაც ხართ(გამოიყენე შექმნილი age ცვლადი). დაბეჭდე ერთი print()-ფუნქციის მეშვეობით
age=(26)
fullname=("giorgi iadze ")
print(fullname*age)