#1) შექმენით სია სადაც, შეიტანთ მინიმუმ 10 რიცხვს, გადაუარეთ for ციკლის დახმარებით და დაბეჭდეთ თითოეული რიცხვი კენტია თუ ლუწი.


numbers = [12, 25, 37, 48, 53, 60, 71, 80, 92, 101]

for num in numbers:

    if num % 2 == 0:
        print(f"{num} არის ლუწი")
    else:
        print(f"{num} არის კენტი")


#2) შექმენით სახელების სია სადაც გექნებათ მინიმუმ 10 სახელი, დაბეჭდეთ ამ სიიდან მხოლოდ ის სახელები რომლების ინდექსებიც არის ლუწი


names = ["მარიამი", "გიორგი", "ანა", "თამარი", "ნიკა", "გოგა", "ელენე", "ლაშა", "სალომე", "თეო"]

for index in range(len(names)):

    if index % 2 == 0:
        print(names[index])


#3) შექმენით სია სადაც გექნებათ 10 რიცხვი, თქვენი დავალებაა გაიგოთ ამ სიაში ყველა ლუწი და კენტი რიცხვიოს ჯამი და დაბეჭდოთ

numbers = [12, 25, 37, 48, 53, 60, 71, 80, 92, 101]

even_sum = 0  
odd_sum = 0  

for num in numbers:
    if num % 2 == 0:  
        even_sum += num  
    else:
        odd_sum += num 

print("ლუწი რიცხვების ჯამი:", even_sum)
print("კენტი რიცხვების ჯამი:", odd_sum)


#4) შექმენით სია სადაც გექნებათ 10 რიცვი, შემდეგ შექმენით ახალი სია, 
#სადაც ჩაამატებთ პირველი სიიდან ყველა ლუწ რიცხვს და გაიგებთ მათ საშუალო არითმეტიკულს.
#(ახალ სიაზე გამოიყენეთ len() ფუნქცია)

numbers = [12, 25, 37, 48, 53, 60, 71, 80, 92, 101]

even_numbers = []

for num in numbers:
    if num % 2 == 0:
        even_numbers.append(num)

average = sum(even_numbers) / len(even_numbers) if len(even_numbers) > 0 else 0

print("ლუწი რიცხვების სია:", even_numbers)
print("ლუწი რიცხვების საშუალო არითმეტიკული:", average)
