#1) მომხარებელს შემოატანინეთ ორი რიცხვი, აიყვანეთ ისინი მე-3 ხარისხში და გაიგეთ მათი ჯამი, 
# თუ ჯამი ლუწია დაპრინტეთ "Result is Even", სხვა შემთვევაში "Result is Odd"
#აღწერეთ თითოეული მოქმედება კომენტარებით

# შემოვატანინეთ მომხმარებელს ორი რიცხვი
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))  # პირველი რიცხვი
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))  # მეორე რიცხვი

# ორივე რიცხვი ავიყვანე  მე-3 ხარისხში
num1_cubed = num1 ** 3  # პირველი რიცხვის მე-3 ხარისხი
num2_cubed = num2 ** 3  # მეორე რიცხვის მე-3 ხარისხი

# ჯამის გამოთვლა
total = num1_cubed + num2_cubed  # პირველი და მეორე რიცხვის მე-3 ხარისხის ჯამი

# შემოწმება, არის თუ არა ჯამი ლუწი ან კენტი
if total % 2 == 0:  # თუ რიცხვი ლუწია
    print("Result is Even")  # თუ ჯამი ლუწია, დავბეჭდოთ "Result is Even"
else:  # თუ რიცხვი კენტია
    print("Result is Odd")  # თუ ჯამი კენტია, დავბეჭდოთ "Result is Odd"



#1) შექმენით სია, რომელსაც შეინახავთ ცვლადში სახელად friends. მაგ სიაში უნდა შეინახოთ მინიმუმ 5 მეგობრის სახელი. 
#პირველ რიგში გამოიტანეთ თქვენი საუკეთესო მეგობრის სახელი ინდექსების დახმარებით. დაბეჭდეთ სია. 
#შეცვლაეთ მე-3 ინდექსზე მყოფი სახელი ახალით და დაბეჭდეთ სია. 
#საბოლოოდ დაბეჭდეთ მთლიანი სიის სიგრძე

friends = ["ნიკა", "გიორგი", "მარიამი", "ანა", "თამარი"]

print(friends[0])

print(friends) 

friends[3] = "ალექსი"  

print(friends) 

print(len(friends))



#2) შექმენით მანქანების სია, სადაც გამოიყენებთ ერთ-ერთ ფუნქციას, რომ სიაში დაამატოთ ახალი მანქანა.
#ხელით არ უნდა ჩაწეროთ!!!

cars = ["BMW", "Audi", "Mercedes", "Tesla"]

cars.append("Toyota")  # .append() ფუნქცია დაამატებს ახალ ელემენტს სიის ბოლოს

print(cars)


#3) შექმენით რიცხვების სია სადაც გექნებათ მინიმუმ ხუთი რიცხვი. შეცვლაეთ ამ სიის პირველი ელემენტი და გაუტოლეთ ის 50-ს. 
# შემდეგ კი გამოიტანეთ სიიდან პირველი და ბოლო რიცხვის ჯამი


numbers = [10, 20, 30, 40, 60]

numbers[0] = 50

sum_of_first_and_last = numbers[0] + numbers[-1]

print("პირველი და ბოლო რიცხვის ჯამი:", sum_of_first_and_last)






