#1) მომხმარებელს შემოატანინეთ სახელი,გვარი,ასაკი,საცხოვრებელი ადგილი და მეილი. კომენტარებით ახსენით რას ნიშნავს თითო ხაზი ამ კოდის
first_name=str(input("enter your first-name: ")) #აქ კლიენტს შემოვატანინე თავისი სახელი
last_name=str(input("enter your last-name: ")) #აქ კლიენტს შემოვატანინე თავისი გვარი 
age=str(input("enter your age: ")) #აქ კლიენტს შემოვატანინე თავისი ასაკი
email=str(input("enter your email: ")) #აქ კლიენტს შემოვატანინე თავისი მეილი
print(first_name+" "+last_name+" "+age+" "+email) #აქ კი გავუშვი სქრინზე ჩემი ზემოთ ჩამოთვლილი მოქმედებები მონაცემების შემოსატანად

#2) მომხმარებელს შემოატანინეთ ასაკი და დაუპრინტეთ რამდენი წლის იქნება ის 20 წელიწადში
age=int(input("how old are you?: ")) #აქ მომხმარებელს შევაყვანინე თავისი ასაკი 
print(age+20) #აქ კი მომხმარებლის ასაკ დავუმატე 20 წელი 