#პაროლის ვალიდაციის პროგრამა:
#შექმენით ცვლადი სადაც შეინახავთ პაროლს(მაგალითად: goa1234)
#სანამ მომხარებელი არ შემოიყვანს სწორ პაროლს მანამდე შემოატანინეთ ხელახლა. 
# მომხარებელს ექნება 3 ცდა. თუ შემოიყვანა სწორი პაროლი დაუპრინტეთ "წვდომა მიღებულია", სხვა შემთხვევაში "სცადეთ ხელახლა", 
#დაპრინტეთ რამდენი მცდელობა დარჩა და გამოაკელით ცდას ერთი. როდესაც მცდელობები ამოიწურება გათიშეთ while loop-ი


correct_password = "goa1234"

attempts = 3

while attempts > 0:
    
    user_input = input("შეიყვანეთ პაროლი: ")
    
    
    if user_input == correct_password:
        print("წვდომა მიღებულია")
        break  
    
    else:
        attempts -= 1 
        if attempts > 0:
            print(f"სცადეთ ხელახლა, დარჩენილი მცდელობა: {attempts}")
        else:
            print("მცდელობები ამოიწურა, დაშვება აკრძალულია.")
