#2) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა რიცხვი, 
# ხოლო ამ ფუნქციამ უნდა დაბეჭდოს 1-დან გადმოცემულ რიცხვამდე ყველა რიცხვი

def print_numbers(n):
    #ციკლი, რომელიც დაბეჭდავს რიცხვებს 1-დან n-მდე
    for i in range(1, n + 1):
        print(i)

print_numbers(5)

#3) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა ორი რიცხვი, 
# ხოლო ამ ფუნქციამ უნდა დააბრუნოს პირველი რიცხვი აყვანილი მე-2 რიცხვის ხარისხში

def power(base, exponent):
    # პირველი რიცხვი ამყავს მეორე რიცხვის  ხარისხში
    return base ** exponent

# მაგალითი: 2-ის ამაღლება 3-ის ხარისხში
result = power(2, 3)
print(result)  




