#1) while ციკლის გამოყენებით დაპრინტეთ 1-დან 50-მდე ყველა 4-ის ჯერადი რიცხვის კუბი

num = 0  # აქ შევქმენი ცვლადი რომელსაც მივანიჭე მნიშვნელობა 0

while num < 50:   #შემოვიტანე ვილ ციკლი რათა გამეგო 50 მდე ყველა 4-ის ჯერადი რიცხვი
    if num % 4 == 0:  # გავარკვიე 4 ის ჯერადი რიცხვები 
        print(num ** 3)  # 4-ის ჯერადი რიცხვები ავიყვანე მესამე ხარისხში
    num += 1  # ნამ ცვლადს ვილ ციკლში მივეცი მითითება რომ ყოველ ნაბიჯზე მოემატოს 1 რათა ციკლი არ იყოს უსასრულო 





#2) შექმენით რიცხვების დიაპაზონი 1-დან 100-მდე, შეამოწმეთ თუ რიცხვი იყოფა 3-ზე დაბეჭდეთ "Fizz" და გვერდზე მიუწერეთ რიცხვი. 
#თუ რიცხვი იყოფა 5-ზე დაბეჭდეთ "Buzz" და გვერდზე მიუწერეთ რიცხვი, 
#xოლო თუ იყოფა 3-ზეც და 5-ზეც დაბეჭდეთ "FizzBuzz" და გვერდზე მიუწერეთ რიცხვი

for i in range(1, 100): # შევქმენი რიცხვების დიაპაზონი 1 დან 100 მდე 
    if i % 3 == 0:  # გავარკვიე რიცხვები რომლებიც იყო სამზე 
        print("Fizz " + str(i))
    elif i % 5 == 0: # აქ გავარკვიე რიცხვები რომლებიც იყოფა 5 ზე 
        print("Buzz " + str(i))
    elif i % 5 == 0 and i % 3 == 0: # აქ  გავარკვიე რიცხვები რომლებიც იყოფა 3 ზეც და 5 ზეც 
        print("FizzBuzz " + str(i)) #  აქ კი დავპრინტე მიღებული შედეგი რიცხვებთან ერთად 





#3) შექმენით ორი ცვლადი, პირველში შეინახეთ 1-დან 20-ის ჩათვლით ყველა ლუწი რიცხვის ჯამი, მეორეში კი ყველა კენტის.
#აიყვანეთ ორივე მე-5 ხარისხში და დაპრინტეთ ის, რომელიც არის მეტი

sum1 = 0  # შევქმენი ერთი ცვლადი

sum2 = 0 # შევქმენი მეორე ცვლადი 

for i in range(1, 21):  # შემოვიტანე ფორ ციკლი  1-დან 20-ის ჩათვლით
    if i % 2 == 0: # აქ ვგებულობ ლუწ რიცხვებს 
        sum1 += i #  ლუწ რიცხვებს ვუყრი სუმ ცვლადში თავს 
    else:
        sum2 += i # აქ კენტ რიცხვებს ვუყრი თავს  სუმ2 ცვლადში

sum1 = sum1 ** 5  # აქ ამყყავს მეხუთე ხარისხში მიღებული ლუწი რიცხვების ჯამი

sum2 = sum2 ** 5 # ამყავს მეხუთე ხარისხში კენტი რიცხვების ჯამი 

if sum1 > sum2:  #ვაძლევ მითითებას თუ რომელია მეტი
    print("sum1 is more") # თუ მეტია სუმ 1-ის ჯამი დაიპრინტოს sum1 is more
elif sum1 < sum2:
    print("sum2 is more") # თუ მეტია სუმ 2-ის ჯამი დაიპრინტოს sum2 is more
else:
    print("they are equal") # სხვა შემთხვევაში ისინი ტოლია ერთმანეთის 



#4) True or False and 5 > 3 or "name" == "name" and 123 == "123" and 5 >= 5 <--- გაიგეთ რას გამოიტანს ეს კოდი და ახსენით რატომ.

print(True or False and 5 > 3 or "name" == "name" and 123 == "123" and 5 >= 5)

#5) მომხარებელს შემოატანინეთ რიცხვი და გაიგეთ არის თუ არა ის მარტივი, თუ მარტივია დაპრინტეთ "Number is prime", 
#სხვა შემთხვევაში "Number is not prime"(მარტივია რიცხვი, რომელიც იყოფა მარტო თავის თავზე და ერთზე)

num1 = int(input("Enter number> "))

if num1 > 1:
    is_prime = True
    for i in range(2, int(num1 ** 0.5) + 1):
        if num1 % i == 0:
            is_prime = False
            break
    if is_prime == True:
        print("number is prime")
    else:
        print("number is not prime")
else:
    print("number is not prime")








#6) კომენტარებით ახსენით თქვენი თითოეული მოქმედება


# შესრულებულიაააა ;)